<template>
    <div class="pt-qa">
        <div class="subpage-title">
            Частые вопросы
        </div>

        <div class="pt-qa-menu">
            <div v-for="pt in ptQA" class="pt-qa-menu-item" @click="pull(pt.id)" :id="pt.id" :key="pt.id">
                <div class="menu-item-container">
                    <div class="chevron-right-col1"/>
                    <div class="copy-address-box"><div class="copy-address-name">{{ pt.title }}</div></div>
                </div>
                <Transition name="pop-menu" mode="in-out">
                <p class="menu-item-text" :id="pt.id + '-text'">{{ pt.text }}</p>
                </Transition>
            </div>

        </div>
    </div>
</template>

<script>

export default {
    data: () => {
        return {
            ptQA: [
                {
                    id:'q1',
                    title: 'Через какое время можно проводить повторное измерение артериального давления?',
                    text: 'Повторное измерение артериального давления проводится по мере необходимости. Желательно соблюдать интервал не менее 1-2 минут между измерениями. Если проводиться 2-3 повторных измерений, то регистрируется средняя величина этих измерений.'
                }, 
                {
                    id:'q2',
                    title: 'Как предупредить возникновение гипертонических кризов и резкого повышения артериального давления?',
                    text: 'Причиной возникновения гипертонического криза при артериальной гипертензии чаще всего является нерегулярная медикаментозная терапия, самостоятельная отмена препарата и уменьшение его дозировки, избыточное потребление соленой пищи. Профилактикой гипертонических кризов, является контроль артериального давления и постоянный прием препаратов, назначенных врачом.'
                }, 
                {
                    id: 'q3',
                    title: 'Почему избыток соли и соленая пища вредна для гипертоников?',
                    text: 'Избыток соли вызывает спазм сосудов и приводит к задержке жидкости, тем самым способствует увеличению объема крови в сосудах, это приводит к непосредственному увеличению АД.'
                },
                {
                    id: 'q4',
                    title: 'Какие препараты лучше применять для лечения гипертонии?',
                    text: 'Препараты для контроля над уровнем артериального давления должны быть подобраны врачом, с учетом наличия сопутствующей патологии, возраста, пола, наличия поражений органов мишеней, противопоказаний и индивидуальной переносимости.'
                },
                {
                    id: 'q5',
                    title: 'Можно ли лечить артериальную гипертонию курсами или принимать препараты только при повышении давления?',
                    text: 'Артериальная гипертония является хроническим заболеванием, поэтому лечение должно быть постоянным и прием, назначенных врачом медикаментов, регулярным.'
                },
                {
                    id: 'q6',
                    title: 'Достаточно ли только принимать таблетки при гипертонии?',
                    text: 'Прием таблеток будет недостаточным, для замедления прогрессирования заболевания желательно изменение образа жизни, что также будет способствовать улучшению общего самочувствия и профилактике осложнений.'
                },
                {
                    id: 'q7',
                    title: 'Какие лекарства считаются наиболее эффективными для лечения гипертонии?',
                    text: 'На сегодняшний день для лечения артериальной гипертонии и контроля над уровнем АД рекомендуется прием нескольких препаратов с разным механизмом действия. Это более эффективно, поскольку комбинация нескольких механизмов позволяет назначать препараты не в высоких дозах и одновременно воздействовать на разные пути, способствующие повышению АД. При этом несколько препаратов могут содержаться в одной таблетке. Терапия подбирается индивидуально, поэтому необходимо, чтобы терапия была назначена врачом.'
                },
                {
                    id: 'q8',
                    title: 'Можно ли не лечить давление, если я совершенно не ощущаю повышение АД?',
                    text: 'Если не лечить артериальную гипертонию это может привести к осложнениям (развитию инсульта, инфаркта, аритмий, поражению почек и т.п.). Повышенное артериальное давление увеличивает риск преждевременной смерти.'
                },
                {
                    id: 'q9',
                    title: 'Врач прописал лекарства, но они мне не помогают. В чем причина?',
                    text: 'Подбор эффективной терапии при артериальной гипертонии и достижение целевого уровня АД может занимать длительное время (до нескольких месяцев) с учетом индивидуальных особенностей каждого пациента. Артериальная гипертония - это заболевание, на которое влияет множество факторов, такие как: наследственность, избыток жирной и соленой пищи в рационе, малоподвижный образ жизни, вредные привычки, сопутствующие заболевания и т.д. Возможно, Вам необходимо дополнительное обследование для выяснения причины отсутствия эффекта от назначенной терапии'
                },
                {
                    id: 'q10',
                    title: 'Какие продукты гипертонику полезны, а какие лучше ограничить?',
                    text: 'Обязательно нужно ограничить соль и животные жиры. Ешьте больше овощей, зелени, ягод, фруктов.'
                },
                {
                    id: 'q11',
                    title: 'Можно ли одно гипотензивное средство принимать годами? Правда ли, что следует периодически менять лекарства?',
                    text: 'Артериальная гипертония — заболевание хроническое, и лекарства для контроля уровня АД нужно принимать на протяжении всей жизни. Если через какое-то время препарат перестает снижать артериальное давление, либо недостаточно эффективен, то врач может заменить его, либо увеличить дозировку препарата.'
                },
                {
                    id: 'q12',
                    title: 'Каким тонометром лучше всего измерять АД при наличии аритмии?',
                    text: 'На сегодняшний день для лечения артериальной гипертонии и контроля над уровнем АД рекомендуется прием нескольких препаратов с разным механизмом действия. Это более эффективно, поскольку комбинация нескольких механизмов позволяет назначать препараты не в высоких дозах и одновременно воздействовать на разные пути, способствующие повышению АД. При этом несколько препаратов могут содержаться в одной таблетке. Терапия подбирается индивидуально, поэтому необходимо, чтобы терапия была назначена врачом.'
                },

            ]
        }
    },
    methods: {

        pull(id) {
            const item = document.getElementById(id)
            if(item) {
                if (item.className.endsWith('active')) {
                    item.className = 'pt-qa-menu-item'
                    document.getElementById(id + '-text').style.display = 'none'
                } else {
                    item.className = 'pt-qa-menu-item-active'
                    document.getElementById(id + '-text').style.display = 'block'
                }
            }
        }, 
             
    }
}

</script>

<style>

.pt-qa * {
    transition: all 0.2s ease-out;
}

.pt-qa .chevron-right-col1 {
    margin-right: 0.5rem;
}

.pt-qa-menu-item-active .chevron-right-col1 {
    transform: rotate(90deg);
}

.copy-address-box  {
    display: inline-flex;
    align-items: center;
    border-radius: 0.5rem;
    background-color: #e4f0ff;
    padding: 0.25rem 0.5rem;
    max-width: auto;
}

.pt-qa .copy-address-name {
    display: inline-block;
    height: 100%;
    text-wrap: wrap;
    font-size: 1rem;
}

.pt-qa-menu-item .copy-address-box {
    background-color: #e4f0ff;
}

.pt-qa-menu-item .copy-address-name {
    color: var(--component-accent-color2);
}


.pt-qa-menu-item .copy-address-box:hover {
    background-color: #d7e7fa;
}

.pt-qa-menu-item-active .copy-address-box {
    background-color: #f16676;
}

.pt-qa-menu-item-active .copy-address-box .copy-address-name {
    color: #FFF
}

.pt-qa-menu-item, .pt-qa-menu-item-active {
    padding: 0.5rem 0;
    width: 100%;
    cursor: pointer;
}

.menu-item-container {
    display: flex;
    align-items: center;
    width: 100%;
    flex-wrap: nowrap;
}

.pt-qa .menu-item-text {
    display: none;
    margin: 1rem 0 0.5rem 1.75rem;
    
}

@media only screen and (max-width: 1023px) and (min-width: 769px) {
    .pt-qa .chevron-right-col1 {
    margin-right: 1rem;
}
}

@media only screen and (min-width: 1024px) {

    .pt-qa .chevron-right-col1 {
    margin-right: 1rem;
}
}




</style>