<template>
    <div class="about-head">
        <div class="subpage-title">
            Руководство
        </div>

        <div class="about-head-box">
            <div class="about-head-img">
                <img src="/head_images/head_1.jpg">
            </div>
            
            <div class="about-head-name-box">
                <!--<ChevronLeft color="red"/>-->
                <div class="head-name">
                    Джунусбекова Гульнара Алдешовна
                </div>
            </div>
            <div class="about-head-text">
                <p>Джунусбекова Гульнара Алдешовна, доктор медицинских наук, ассоциированный профессор, Президент ОО «Общество специалистов по артериальной гипертонии и кардиоваскулярной профилактике», заведующая кафедрой кардиологии Казахского медицинского университета непрерывного образования, профессор кафедры кардиологии НАО НМУ имени С.Д.Асфендиярова. 
                </p>
                <br>
                <p>
                Окончила лечебный факультет Алматинского государственного медицинского института. 
                Работала врачом-терапевтом в Алматинской областной клинической больнице, врачом-кардиологом в Республиканском научно-исследовательском центре охраны здоровья матери и ребенка МЗ РК, врачом-кардиологом в Казахском НИИ кардиологии МЗ РК. Прошла обучение в клинической ординатуре по специальности «кардиология» в Казахском НИИ кардиологии МЗ РК.
                Прошла трудовой путь от младшего научного сотрудника до ведущего научного сотрудника НИИ кардиологии и внутренних болезней МЗ РК.
                </p>
                <br>
                <p>
                <pre>В 2003 г. защитила кандидатскую диссертацию по специальности «кардиология».</pre>
                <pre>В 2009г. защитила докторскую диссертацию по специальности «кардиология» и «внутренние болезни».</pre>
                <pre>С 2010 г. по 2011г. работала заведующей кафедры последипломного образования НИИ кардиологии и внутренних болезней МЗ РК.</pre>
                <pre>С 2011 г. по 2018г. работала заместителем директора по стратегическому развитию, науке и последипломному образованию НИИ кардиологии и внутренних болезней МЗ РК.</pre>
                <pre>С 2018 по 2019гг. является заведующей кафедры кардиологии АО «Казахский медицинский университет непрерывного образования.</pre>
                <pre>С сентября 2019 г. также является профессором кафедры кардиологии НАО НМУ имени С.Д.Асфендиярова.Автор 3-х монографий, более 300 статей, 12 патентов на изобретения.</pre>
                </p>
                <br>
                <p>
                Награждена медалью «Денсаулык сақтау ісіне қосқан ұлесі ұшін», медалью «Денсаулык сақтау ісінінін қосқан ұздігі» Почетной Грамотой Министра здравоохранения РК. </p>
            </div>
        </div>

        <div class="about-head-box">
            <div class="about-head-img">
                <img src="/head_images/head_2.jpg">
            </div>
            
            <div class="about-head-name-box">
                <!--<ChevronLeft color="red"/>-->
                <div class="head-name">
                    Тундыбаева Мира Капсиметовна
                </div>
            </div>
            <div class="about-head-text">
                <pre>Доктор медицинских наук, профессор кафедры кардиологии НАО «Казахский национальный медицинский университет им. С.Д. Асфендиярова».</pre>
                <pre>Вице-президент ОО «Общества специалистов по артериальной гипертонии и кардиоваскулярной профилактике», член Ассоциации кардиологов Казахстана, Ассоциации терапевтов Казахстана, ESC (Европейской ассоциациикардиологов).</pre>
                <br>
                <pre>Научные интересы: кардиология, терапия, клиническая фармакология. Автор более 200 научных публикаций, в том числе зарубежных, патентов, методических рекомендаций для врачей.</pre>
                <br>
                <p>Тундыбаева М.К. является разработчиком Государственного общеобязательного стандарта образования по резидентуре и типовой профессиональной учебной программы резидентуры по специальности «Кардиология, в том числе детская», 2015 г., а также разработчиком типовых программ повышения квалификации и переподготовки медицинских и фармацевтических кадров по специальности «Кардиология», 2017 г., утвержденных МЗ РК.</p></div>
        </div>
    </div>
    
</template>

<script>
import ChevronLeft from '@/components/ChevronLeft.vue';

export default {
    components: {ChevronLeft}
}


</script>



<style>


.about-head-box {
    margin-bottom: 2rem;
} 

.about-head-title {
    margin-bottom: 1rem;
}

.about-head-img {
    width: 100%;
    text-align: center;
}

.about-head-img img {
    width: 100%;
    height: auto;
}

.about-head-name-box {
    width: 100%;
    display: flex;
    flex-wrap: nowrap;
    align-items: center;
    margin: 1rem 0;
}

.head-name {
    display: inline-block;
    color: var(--component-accent-color2);
    font-weight: 500;
    font-size: 1.25rem;
}

@media only screen and (min-width: 768px) {

}

@media only screen and (min-width: 1024px) {

.about-head-box {
    margin-bottom: 4rem;
} 

.about-head-img img {
    width: 60%;
    height: auto;
}

}
</style>