<template>
    <div class="about-society">
        <div class="subpage-title">
            Об Обществе
        </div>
        
        <div class="about-society-content">
            <p class="cursive">
                —  ОО «Общество специалистов по артериальной гипертонии и кардиоваскулярной профилактике»
            </p>
            <br><br><br>
            <p>Общественное объединение «Общество специалистов по артериальной гипертонии и кардиоваскулярной профилактике» создано с целью содействия и усиления профилактической направленности здравоохранения в области кардиологии, с акцентом на артериальную гипертензию. Важная особенность Объединения – междисциплинарность его исследовательских направлений и задач, а также сочетание научной и научно-практической деятельности.</p>
            <br><br>
            <p>ОО «Общество специалистов по артериальной гипертонии и кардиоваскулярной профилактике» создано и официально зарегистрировано в 2017 году. Членами Общества являются кардиологи, терапевты, врачи общей практики и другие специалисты разного профиля, заинтересованные в улучшение ситуации с сердечно-сосудистыми заболеваниями в Республике Казахстан.</p>
            <br><br>
            <p>Общество является организатором ежегодного Конгресса по артериальной гипертонии и кардиоваскулярной профилактике, кроме этого проводит конференции и симпозиумы по наиболее актуальным темам в кардтологии с привлечением ведущих отечественных и зарубежных специалистов, которые пользуются большим интересом среди медицинской общественности.</p>
            <br><br>
            <p>Президентом общества является д.м.н., ассоциированный профессор Джунусбекова Гульнара Алдешовна. Вице-президентом д.м.н., Тундыбаева Мейрамгуль Капсиметовна.</p>
        
        </div>
    </div>

</template>

<style>

p.cursive {
    font-family: var(--cursive-font);
    font-style: italic;
} 

</style>