<template>
    <div class="membership">
        <div class="subpage-title">
            Информация о членстве
        </div>

        <div class="question">
            <ChevronHeader text="Кто может стать участником ОСАГКП?"/>
        </div>

        <div class="sigle-p">
            <p>Членство в ОСАГКП открыто для всех медицинских и немедицинских специалистов, прямо или косвенно участвующих в наших основных проектах и мероприятиях.</p>
        </div>

        <div class="question">
            <ChevronHeader text="Как стать участником ОСАГКП?"/>
        </div>

        <div class="membership-content">
            <p>Заявку на членство можно подать онлайн по адресу https://ahcvp.kz/. В течение 3 месяцев Ваше заявление будет рассмотрено и Вам будет предоставлен ответ о Вашем статусе.</p><br>
<pre>Преимущества членства включают возможность Общения с профессионалами-единомышленниками, доступ к новостям науки, информационные бюллетени для участия в мероприятиях ОСАГКП. Являясь членом ОО «Общества специалистов по артериальной гипертонии и кардиоваскулярной профилактики», Вы сможете:</pre>
<li>получать рассылку уникальных новостей по артериальной гипертонии и кардиоваскулярной профилактике, научно-медицинских статей, разборов клинических случаев;</li>
<li>бесплатно участвовать в образовательных онлайн программах и получать сертификат от ОО «Общества специалистов по артериальной гипертонии и кардиоваскулярной профилактики»;</li>
<li>получать актуальные клинические рекомендации,в том числе доступ крекомендациям Европейского общества кардиологов бесплатно на запланированных мероприятиях республиканского масштаба;</li>
<br>
<p>Станьте членом и поднимите свою карьеру и знания на новый уровень. ПОДАТЬ ЗАЯВКУ ОНЛАЙН НА САЙТЕ или отправить скан заявления (прикрепить образец заявления) на почту ashypertension.kz@gmail.com</p>
        </div>

            <router-link tag="span" class="request-button-box" to="/specialists/membership-request/">

                <div class="long-blue-button">
                    Подать заявку на членство
                </div>

            </router-link>

    </div>
    
</template>

<script>
import ChevronHeader from '@/components/ChevronHeader.vue';

export default {
    components: {ChevronHeader},
  setup() {
  }
}

</script>


<style>

    .request-button-box {
        display: block;
        margin-top: 2rem; 
    }


</style>