<template>
    <div class="education">
        <div class="subpage-title">
            Обучение
        </div>

        <p>Для всех желающих врачей ОО “Общество специалистов по артериальной гипертонии и кардиоваскулярной профилактике” будет проводить БЕСПЛАТНЫЕ ВЕБИНАРЫ по ведению пациентов с фибрилляцией предсердий, где будут подробно представлены и обсуждены вопросы патогенеза развития фибрилляции предсердий, факторы риска тромбоэмболических осложнений, критерии диагностики и тактика лечения пациентов с данной нозологией.</p>
        <br>
        <p>Вы можете оставить заявку на участие в бесплатных вебинарах, заполнив форму!</p>
        <br>
        <p>По мере обработки заявок и ближе к датам обучения сотрудники Общества свяжутся с Вами для информирования о датах, времени проведения вебинаров и будет выслана ссылка на подключение.</p>
        <br>
        <p>Обучающие вебинары запланированы к проведению с апреля 2023 года.</p>
        <br>
        <p>Даты и время проведения будет назначены позже.</p>

        <router-link to="/specialists/education-request/" class="request-button-box disabled-a" >
                <input type="submit" disabled="true" class="long-blue-button" value = "Подать заявку на обучение">
        </router-link>
    </div>
</template>

<script>
import EducationRequest from './EducationRequest.vue';

export default {
    components: {EducationRequest} 
}

</script>

<style>



</style>